<!-- dflook/terraform-github-actions {"workspace":"early-eval","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"2d19a0a822c53ae4080e1f8d20e4fa352f3023e8b111ac92db0e2418928a1149","plan_job_ref":"Job Test actions using target and replace #479 at https://github.com/dflook/terraform-github-actions/actions/runs/14146350312","plan_hash":"32dfe0caca18947d066180b7315bd31520d2c0e89ad8ff808f8fff63ec9332dc","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __early-eval__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "TJSKWiKQUY" -> (known after apply)
!~  foreach = "PWK6D9x59X" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #479](https://github.com/dflook/terraform-github-actions/actions/runs/14146350312)